double K(double x) /* эллиптический интеграл 1-го рода */
{
	int i;
	double tur,m,m1, sum1, sum2, a[5], b[5];

	m1 = 1.0 - x * x;

	a[0] = 1.38629436112;
	a[1] = 0.09666344259;
	a[2] = 0.03590092383;
	a[3] = 0.03742563713;
	a[4] = 0.01451196212;

	b[0] = 0.5;
	b[1] = 0.12498593597;
	b[2] = 0.06880248576;
	b[3] = 0.03328355346;
	b[4] = 0.00441787012;

	m = 1.0;
	sum2 = sum1 = 0.0;

	for(i = 0; i <= 4; i++)
	{
		sum1 += a[i] * m;
		sum2 += b[i] * m;

		m = m * m1;
	}

	tur = sum1 - sum2 * log(m1);

	return(tur);
} /* K */


